{
    "teamName": "Innovation Lab",
    "manager": {
      "name": "Sarah Chen",
      "position": "Innovation Director",
      "description": "Experienced leader with a background in product development and a passion for fostering creativity.",
      "okrs": [
        {
          "objective": "Launch two groundbreaking products",
          "keyResults": [
            "Successfully release Product A by Q3",
            "Achieve 100,000 users for Product B within 6 months of launch",
            "Maintain team satisfaction score above 85%"
          ]
        }
      ]
    },
    "teamMembers": [
      {
        "name": "Alex Rodriguez",
        "position": "Senior Developer",
        "description": "Full-stack developer with expertise in AI and machine learning.",
        "okrs": [
          {
            "objective": "Improve AI capabilities of our main product",
            "keyResults": [
              "Implement three new AI features by Q4",
              "Reduce model training time by 30%",
              "Achieve 95% accuracy in natural language processing tasks"
            ]
          }
        ]
      },
      {
        "name": "Priya Patel",
        "position": "UX Designer",
        "description": "Creative designer focused on user-centered design principles and accessibility.",
        "okrs": [
          {
            "objective": "Enhance user experience across all products",
            "keyResults": [
              "Increase overall user satisfaction score from 7.5 to 8.5",
              "Reduce user onboarding time by 25%",
              "Implement accessibility features to meet WCAG 2.1 AA standards"
            ]
          }
        ]
      },
      {
        "name": "Marcus Johnson",
        "position": "Data Scientist",
        "description": "Statistical expert with a knack for turning data into actionable insights.",
        "okrs": [
          {
            "objective": "Drive data-informed decision making across the organization",
            "keyResults": [
              "Develop 5 predictive models to forecast key business metrics",
              "Increase data literacy among non-technical staff by conducting 10 training sessions",
              "Reduce data processing time for main analytics pipeline by 40%"
            ]
          }
        ]
      },
      {
        "name": "Emma Watson",
        "position": "Product Manager",
        "description": "Strategic thinker with a track record of successful product launches.",
        "okrs": [
          {
            "objective": "Optimize product development lifecycle",
            "keyResults": [
              "Reduce time-to-market for new features by 20%",
              "Increase feature adoption rate from 60% to 75%",
              "Achieve a Net Promoter Score (NPS) of 40 or higher"
            ]
          }
        ]
      },
      {
        "name": "Yuki Tanaka",
        "position": "Junior Developer",
        "description": "Recent graduate with a passion for mobile app development and IoT.",
        "okrs": [
          {
            "objective": "Become a key contributor to the mobile development team",
            "keyResults": [
              "Complete 3 major features for the mobile app independently",
              "Achieve code review approval rate of 90% or higher",
              "Reduce bug count in personal code submissions by 50%"
            ]
          }
        ]
      }
    ]
  }